errors = {
    "InternetError": {
        'name': 'Ошибка доступа к сети',
        'text': 'Невозможно подключиться к серверу. Пожалуйста, проверьте Ваше подключение к Интернету и повторите '
                'попытку.',
        'button1': 'Ещё раз',
        'button2': 'Закрыть'
    },
    "TaskDeleteError": {
        'name': 'Внимание!',
        'text': 'У этой задачи есть подзадачи. В случае ее удаления все подзадачи будут также удалены.',
        'button1': 'Продолжить',
        'button2': 'Отмена'
    },
    "NotSavedDataError": {
        'name': 'Внимание!',
        'text': 'В случае закрытия этого окна, все несохраненные данные будут утеряны.',
        'button1': 'Продолжить',
        'button2': 'Отмена'
    },
    "ServerDeleteError": {
        'name': 'Внимание!',
        'text': 'У этого сервера есть задачи. В случае удаления сервера все задачи будут также удалены.',
        'button1': 'Продолжить',
        'button2': 'Отмена'
    },
    "EmailError": {
        'name': 'Внимание!',
        'text': 'Вы ввели некорректный email. Проверьте правильность введенного email и повторите попытку.',
        'button1': 'Ок',
        'button2': 'Закрыть'
    }
}

